samples/ITI-47_request_raw.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
 <soap:Header>
  <Action soap:mustUnderstand="true"
   xmlns="http://www.w3.org/2005/08/addressing">urn:hl7-org:v3:PRPA_IN201305UV02</Action>
  <MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:9fe7246b-8fab-4dd7-976e-c81bc1955575</MessageID>
  <To xmlns="http://www.w3.org/2005/08/addressing">https://epd-test.ith-icoserve.com:7443/PIXPDQ/services/PIXPDQV3ManagerService</To>
  <ReplyTo xmlns="http://www.w3.org/2005/08/addressing">
   <Address>http://www.w3.org/2005/08/addressing/anonymous</Address>
  </ReplyTo>
 </soap:Header>
 <soap:Body>
  <PRPA_IN201305UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
   <id root="1.2.3.4"/>
   <creationTime value="20230911143411"/>
   <interactionId extension="PRPA_IN201305UV02" root="2.16.840.1.113883.1.6"/>
   <processingCode code="P"/>
   <processingModeCode code="T"/>
   <acceptAckCode code="AL"/>
   <receiver typeCode="RCV">
    <device classCode="DEV" determinerCode="INSTANCE">
     <id root="1.3.6.1.4.1.21367.2017.2.5.97"/>
     <asAgent classCode="AGNT">
      <representedOrganization classCode="ORG" determinerCode="INSTANCE">
       <id root="1.3.6.1.4.1.21367.2017.2.7.127"/>
      </representedOrganization>
     </asAgent>
    </device>
   </receiver>
   <sender typeCode="SND">
    <device classCode="DEV" determinerCode="INSTANCE">
     <id root="1.2.3.4"/>
    </device>
   </sender>
   <controlActProcess classCode="CACT" moodCode="EVN">
    <code code="PRPA_TE201305UV02" codeSystem="2.16.840.1.113883.1.6"/>
    <queryByParameter>
     <queryId extension="16944356511831" root="1.2.840.114350.1.13.28.1.18.5.999"/>
     <statusCode code="new"/>
     <responseModalityCode code="R"/>
     <responsePriorityCode code="I"/>
     <parameterList>
      <livingSubjectId>
       <value extension="08242eb8-dd47-4298-8d2f-25d60114f137" root="1.1.1.2.2"/>
       <semanticsText>LivingSubject.id</semanticsText>
      </livingSubjectId>
      <otherIDsScopingOrganization>
       <value root="1.3.6.1.4.1.21367.2017.2.5.93"/>
       <semanticsText>OtherIDs.scopingOrganization.id</semanticsText>
      </otherIDsScopingOrganization>
      <otherIDsScopingOrganization>
       <value root="2.16.756.5.30.1.127.3.10.3"/>
       <semanticsText>OtherIDs.scopingOrganization.id</semanticsText>
      </otherIDsScopingOrganization>
     </parameterList>
    </queryByParameter>
   </controlActProcess>
  </PRPA_IN201305UV02>
 </soap:Body>
</soap:Envelope>
